---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
source: html/4b9e2cd0-d368-c783-9564-40108372efc0.htm
---
# DuctFittingAndAccessoryData Methods

Gets the connector data of the pipe fitting or pipe accessory.